# Python for Data Science
## Session 6
### Datasets â€“ Pandas I

---

## Outline

1. Pandas

2. Loading and exploring datasets 

3. Data cleaning and preprocessing with Pandas

---

## Pandas I

**Pandas** is one of the most used libraries within the Data Science community. It provides a full set of tools to work with:
- 2D data via DataFrame class
    - SQL/Spreadsheet-like datasets (tabular data)
    - Arbitrary matrix data with row and column labels
    - Any type of dataset with observational / statistical data (no labels needed)
- 1D data via Series class
    - Time series data

## Pandas I

As one can see, from the type of datasets **Pandas** can handle, most of the use cases found in Data Science are covered, e.g. finance, health, biology, supply chain, or meteorology. Things **Pandas** do:

1. Handling missing data
2. Change DataFrame size, adding and removing columns and rows at will
3. Automatic data alignment of misaligned data
4. Group by operation
5. Data conversion
6. Advanced indexing
7. Data Merging and joining 
8. Reshaping data
9. Hierarchical indexing
10. Read/write support for CSV, Excel, databases, and fast HDF5 format.
11. Time series manipulation, frequency convertion, window moving statistics

## Pandas I

Let's create a few dataframes using different data structures and see how to start navigating them

In [1]:
## Let's create a simple DataFrame to work with
import pandas as pd
dataset = [
    {
        "name": "Amelie",
        "age": 35
    },
    {
        "name": "Edgar",
        "age": 32
    }
]
df = pd.DataFrame(dataset)
df

     name  age
0  Amelie   35
1   Edgar   32

In [2]:
# Using a slightly different data struture
data = {'Name': ['Amelie', 'Edgar', 'Carlos', 'Victor'],
        'Age': [24, 27, 22, 32],
        'Country': ['FR', 'FR', 'ES', 'GE']}
df = pd.DataFrame(data)
df

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27      FR
2  Carlos   22      ES
3  Victor   32      GE

In [3]:
# we can quickly visualize all the columns a dataframe contains by simply
df.columns

Index(['Name', 'Age', 'Country'], dtype='object')

In [4]:
# Another important thing we can do is to set up any specific index
# these act as row labels
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])
df

     Name  Age Country
A  Amelie   24      FR
B   Edgar   27      FR
C  Carlos   22      ES
D  Victor   32      GE

In [5]:
# Similar to lists and arrays, we can slice
df[:2]

     Name  Age Country
A  Amelie   24      FR
B   Edgar   27      FR

In [6]:
# Similar to lists and arrays, we can also access elements making use of loc and iloc
df.loc['B':'D']

     Name  Age Country
B   Edgar   27      FR
C  Carlos   22      ES
D  Victor   32      GE

In [7]:
# We can access elements using loc and iloc
df.iloc[1:]

     Name  Age Country
B   Edgar   27      FR
C  Carlos   22      ES
D  Victor   32      GE

In [8]:
# We can also access element attributes by using at
df.at[0, 'Age']

KeyError: 0

In [9]:
# if we wanted to do it with iloc, we would need to pass positions
df.iloc[0,1]

24

In [10]:
# Important: to modify a specific value we can use at, loc and iloc
df.loc['B', 'Age'] = 123
df

     Name  Age Country
A  Amelie   24      FR
B   Edgar  123      FR
C  Carlos   22      ES
D  Victor   32      GE

In [11]:
# we can also check what elements satisfy some criteria by column (attribute)
df['Age'] > 25

A    False
B     True
C    False
D     True
Name: Age, dtype: bool

In [12]:
# and show them
df[df['Age'] > 25]

     Name  Age Country
B   Edgar  123      FR
D  Victor   32      GE

In [13]:
# or modify a simple attribute of those that satisfy certain condition
df.loc[df['Age'] > 25, 'Name'] = 'Unknown' # df.iloc[df['Age'] > 25, 0] = 'Unknown'
df

      Name  Age Country
A   Amelie   24      FR
B  Unknown  123      FR
C   Carlos   22      ES
D  Unknown   32      GE

In [14]:
# we can also, similar to the way we do with dicts, add new columns
df['Residency'] = [True, False, True, False]

In [15]:
# or add new elements
df.loc[6] = ['Jordi', 23, 'ES', False]
df.loc[9] = ['Anna', 19, 'ES', False]
df

      Name  Age Country  Residency
A   Amelie   24      FR       True
B  Unknown  123      FR      False
C   Carlos   22      ES       True
D  Unknown   32      GE      False
6    Jordi   23      ES      False
9     Anna   19      ES      False

In [16]:
# There are other methods one can also call
df.head(2)

      Name  Age Country  Residency
A   Amelie   24      FR       True
B  Unknown  123      FR      False

In [17]:
# There are other methods one can also call
df.tail(2)

    Name  Age Country  Residency
6  Jordi   23      ES      False
9   Anna   19      ES      False

In [18]:
df.shape # to get the dataframe shape

(6, 4)

In [19]:
df.dtypes

Name         object
Age           int64
Country      object
Residency      bool
dtype: object

In [20]:
df['Age'].astype('float')

A     24.0
B    123.0
C     22.0
D     32.0
6     23.0
9     19.0
Name: Age, dtype: float64

In [21]:
# Same as numpy, we can find the unique method
df['Country'].unique()

array(['FR', 'ES', 'GE'], dtype=object)

## Pandas I

Among the different methods two important ones are **info** and **describe**:

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       6 non-null      object
 1   Age        6 non-null      int64
 2   Country    6 non-null      object
 3   Residency  6 non-null      bool
dtypes: bool(1), int64(1), object(2)
memory usage: 370.0+ bytes

In [23]:
df.describe()

              Age
count    6.000000
mean    40.500000
std     40.648493
min     19.000000
25%     22.250000
50%     23.500000
75%     30.000000
max    123.000000

## Pandas I

And how do we know about missing elements and handle them?

In [24]:
# What about missing values? Missing values are usually represented as NaN (Not a Number)
import numpy as np
data = {'Name': ['Amelie', 'Edgar', 'Carlos', 'Victor'],
        'Age': [24, 27, 22, 32],
        'Country': ['FR', np.nan, 'ES', 'GE']}
df = pd.DataFrame(data)
df

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27     NaN
2  Carlos   22      ES
3  Victor   32      GE

In [25]:
# we can simply know which ones present missing values by using isna or isnull
df.isna() # at the whole dataframe level

    Name    Age  Country
0  False  False    False
1  False  False     True
2  False  False    False
3  False  False    False

In [26]:
# and at the column level
df['Country'].isnull() # same as .isna()

0    False
1     True
2    False
3    False
Name: Country, dtype: bool

In [27]:
# Simple way of filling these ones is achieved by calling fillna
df.fillna('RE')

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27      RE
2  Carlos   22      ES
3  Victor   32      GE

In [28]:
# There's also possible thing you can do, use the mode (most common value)
#df['Country'].mode()
df.fillna(df['Country'].mode()[0])

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27      ES
2  Carlos   22      ES
3  Victor   32      GE

In [29]:
# IMPORTANT: if we check again the dataframe, we will see that the dataframe keeps having NaNs
# This is because the intented behaviour is usually to keep the DataFrame immutable
# If you want to actually modify you can pass ot fillna, inplace=True
df

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27     NaN
2  Carlos   22      ES
3  Victor   32      GE

In [30]:
# A more drastic operation is to drop any column or row with missing values using
# here, we will modify the original dataframe and drop the rows and cols with nans
df.at[0, 'Age'] = np.nan
df

     Name   Age Country
0  Amelie   NaN      FR
1   Edgar  27.0     NaN
2  Carlos  22.0      ES
3  Victor  32.0      GE

In [31]:
df.dropna()

     Name   Age Country
2  Carlos  22.0      ES
3  Victor  32.0      GE

## Pandas I

One of the handy tools you have in **Pandas** is **groupby**. It allows you to group by any unique attributes within a column and get statistics:
- count
- mean
- sum
- min and max
- multiple aggregations
- group using multiple columns

In [32]:
data = {
    'Name': ['Amelie', 'Edgar', 'Carlos', 'Victor', 'Sofia', 'Jin', 
             'Marta', 'Ali', 'Emily', 'Ravi', 'Chen', 'Fatima', 'Saham'],
    'Age': [24, 27, 22, 32, 29, 31, 28, 26, 23, 34, 25, 30, 26],
    'Country': ['FR', 'US', 'ES', 'GE', 'PT', 'KR',
                'ES', 'AE', 'US', 'IN', 'CN', 'AE', 'AE'],
    'Salary': [70000, 110000, 65000, 82000, 48000, 39000, 45000,
            90000, 97000, 31000, 49000, 85000, 80000]   
}

df = pd.DataFrame(data)
df

      Name  Age Country  Salary
0   Amelie   24      FR   70000
1    Edgar   27      US  110000
2   Carlos   22      ES   65000
3   Victor   32      GE   82000
4    Sofia   29      PT   48000
5      Jin   31      KR   39000
6    Marta   28      ES   45000
7      Ali   26      AE   90000
8    Emily   23      US   97000
9     Ravi   34      IN   31000
10    Chen   25      CN   49000
11  Fatima   30      AE   85000
12   Saham   26      AE   80000

In [33]:
# let's count how many we have per country
df.groupby('Country').count()

         Name  Age  Salary
Country
AE          3    3       3
CN          1    1       1
ES          2    2       2
FR          1    1       1
GE          1    1       1
IN          1    1       1
KR          1    1       1
PT          1    1       1
US          2    2       2

In [34]:
df.groupby('Country')['Age'].mean() # now let's know the average age per country

Country
AE    27.333333
CN    25.000000
ES    25.000000
FR    24.000000
GE    32.000000
IN    34.000000
KR    31.000000
PT    29.000000
US    25.000000
Name: Age, dtype: float64

In [35]:
df.groupby('Country')['Salary'].sum() # total sum of their salaries

Country
AE    255000
CN     49000
ES    110000
FR     70000
GE     82000
IN     31000
KR     39000
PT     48000
US    207000
Name: Salary, dtype: int64

In [36]:
#Â Multiple Aggregations
df.groupby('Country').agg({'Salary': ['min', 'max'], 'Age': 'mean'})

        Salary                Age
           min     max       mean
Country
AE       80000   90000  27.333333
CN       49000   49000  25.000000
ES       45000   65000  25.000000
FR       70000   70000  24.000000
GE       82000   82000  32.000000
IN       31000   31000  34.000000
KR       39000   39000  31.000000
PT       48000   48000  29.000000
US       97000  110000  25.000000

In [37]:
# grouping using more than one column
df.groupby(['Country', 'Age'])['Salary'].count()

Country  Age
AE       26     2
         30     1
CN       25     1
ES       22     1
         28     1
FR       24     1
GE       32     1
IN       34     1
KR       31     1
PT       29     1
US       23     1
         27     1
Name: Salary, dtype: int64

## Pandas I

Let's load *Netflix* titles and do some exercices

In [49]:
# Download from Moodle the zip file containing the netflix dataset
path = 'session_6/netflix_titles.csv'

df = pd.read_csv(path)

In [50]:
df.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

## Pandas I
Let's do the following exercices:

1. Count Missing Values in Each Column

2. Fill Missing 'country' Values with "Unknown"

3. Filter for TV Shows Only

4. Count the Number of Entries per Rating

5. Add a Column Showing Content Age (how many years since it came out)

In [55]:
#Count Missing Values in Each Column
import pandas as pd

path = 'session_6/netflix_titles.csv'

df = pd.read_csv(path)

missing_values_count = df.isnull().sum()

print(df.columns)
print(missing_values_count)

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')
show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [ ]:
#Filter for TV Shows Only
df['country'].fillna("Unknown", inplace=True)

print("Missing values in 'country' column after filling:", df['country'].isnull().sum())

Missing values in 'country' column after filling: 0

C:\Users\omen\AppData\Local\Temp\ipykernel_2180\1311147478.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['country'].fillna("Unknown", inplace=True)

In [ ]:
#Count the Number of Entries per Rating
tv_shows_only = df[df['type'] == 'TV Show']

print(tv_shows_only.head())

  show_id     type                  title         director  \
1      s2  TV Show          Blood & Water              NaN
2      s3  TV Show              Ganglands  Julien Leclercq
3      s4  TV Show  Jailbirds New Orleans              NaN
4      s5  TV Show           Kota Factory              NaN
5      s6  TV Show          Midnight Mass    Mike Flanagan

                                                cast       country  \
1  Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...  South Africa
2  Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...       Unknown
3                                                NaN       Unknown
4  Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...         India
5  Kate Siegel, Zach Gilford, Hamish Linklater, H...       Unknown

           date_added  release_year rating   duration  \
1  September 24, 2021          2021  TV-MA  2 Seasons
2  September 24, 2021          2021  TV-MA   1 Season
3  September 24, 2021          2021  TV-MA   1 Season
4  September 24, 2021          2021  TV-MA  2 Seasons
5  September 24, 2021          2021  TV-MA   1 Season

                                           listed_in  \
1    International TV Shows, TV Dramas, TV Mysteries
2  Crime TV Shows, International TV Shows, TV Act...
3                             Docuseries, Reality TV
4  International TV Shows, Romantic TV Shows, TV ...
5                 TV Dramas, TV Horror, TV Mysteries

                                         description
1  After crossing paths at a party, a Cape Town t...
2  To protect his family from a powerful drug lor...
3  Feuds, flirtations and toilet talk go down amo...
4  In a city of coaching centers known to train I...
5  The arrival of a charismatic young priest brin...

In [58]:

rating_counts = df['rating'].value_counts()

print(rating_counts)

rating
TV-MA       3207
TV-14       2160
TV-PG        863
R            799
PG-13        490
TV-Y7        334
TV-Y         307
PG           287
TV-G         220
NR            80
G             41
TV-Y7-FV       6
NC-17          3
UR             3
74 min         1
84 min         1
66 min         1
Name: count, dtype: int64

In [59]:
#Add a Column Showing Content Age (how many years since it came out)
from datetime import datetime

# Calculate the current year
current_year = datetime.now().year

# Add a new column 'content_age' showing how many years since the content was released
df['content_age'] = current_year - df['release_year']

# Display the first few rows to verify the new column
print(df[['title', 'release_year', 'content_age']].head())

                   title  release_year  content_age
0   Dick Johnson Is Dead          2020            4
1          Blood & Water          2021            3
2              Ganglands          2021            3
3  Jailbirds New Orleans          2021            3
4           Kota Factory          2021            3

## Pandas I

Let's now load the *Titanic* dataset and practice a little bit more:

1. Count the Missing Values in Each Column

2. Fill Missing 'Age' Values with the Mean Age

3. Fill Missing 'Embarked' Values with the Mode (Most Common Value)

4. Filter and Display Passengers Who Paid a Fare Above the Average Fare

5. Add a New Column Indicating Family Size. Create a new column 'FamilySize' as the sum of 'SibSp' (siblings/spouses) and 'Parch' (parents/children)

In [63]:
path = 'session_6/train_and_test2.csv'

df = pd.read_csv(path)

In [ ]:
import pandas as pd
import zipfile

titanic_zip_path = 'session_6/titanic.zip'

with zipfile.ZipFile(titanic_zip_path, 'r') as zip_ref:
    
    zip_ref.extractall('session_6/')
    
    titanic_csv_filename = zip_ref.namelist()[0]

titanic_df = pd.read_csv(f'session_6/{titanic_csv_filename}')

# Count missing values in each column
missing_values_count_titanic = titanic_df.isnull().sum()

# Display the result
print(missing_values_count_titanic)

Passengerid    0
Age            0
Fare           0
Sex            0
sibsp          0
zero           0
zero.1         0
zero.2         0
zero.3         0
zero.4         0
zero.5         0
zero.6         0
Parch          0
zero.7         0
zero.8         0
zero.9         0
zero.10        0
zero.11        0
zero.12        0
zero.13        0
zero.14        0
Pclass         0
zero.15        0
zero.16        0
Embarked       2
zero.17        0
zero.18        0
2urvived       0
dtype: int64

In [69]:
# Fill missing 'Age' values with the mean age
titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)

# Verify the result by checking if there are any missing values left in 'Age'
print("Missing values in 'Age' column after filling:", titanic_df['Age'].isnull().sum())

Missing values in 'Age' column after filling: 0

C:\Users\omen\AppData\Local\Temp\ipykernel_2180\1008188788.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)

In [70]:
# Fill missing 'Embarked' values with the mode (most common value)
titanic_df['Embarked'].fillna(titanic_df['Embarked'].mode()[0], inplace=True)

# Verify the result by checking if there are any missing values left in 'Embarked'
print("Missing values in 'Embarked' column after filling:", titanic_df['Embarked'].isnull().sum())

Missing values in 'Embarked' column after filling: 0

C:\Users\omen\AppData\Local\Temp\ipykernel_2180\2042882019.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['Embarked'].fillna(titanic_df['Embarked'].mode()[0], inplace=True)

In [71]:
#Filter and Display Passengers Who Paid a Fare Above the Average Fare
# Calculate the average fare
average_fare = titanic_df['Fare'].mean()

# Filter passengers who paid a fare above the average
passengers_above_average_fare = titanic_df[titanic_df['Fare'] > average_fare]

# Display the first few rows of the filtered DataFrame
print(passengers_above_average_fare.head())

    Passengerid   Age      Fare  Sex  sibsp  zero  zero.1  zero.2  zero.3  \
1             2  38.0   71.2833    1      1     0       0       0       0
3             4  35.0   53.1000    1      1     0       0       0       0
6             7  54.0   51.8625    0      0     0       0       0       0
23           24  28.0   35.5000    0      0     0       0       0       0
27           28  19.0  263.0000    0      3     0       0       0       0

    zero.4  ...  zero.12  zero.13  zero.14  Pclass  zero.15  zero.16  \
1        0  ...        0        0        0       1        0        0
3        0  ...        0        0        0       1        0        0
6        0  ...        0        0        0       1        0        0
23       0  ...        0        0        0       1        0        0
27       0  ...        0        0        0       1        0        0

    Embarked  zero.17  zero.18  2urvived
1        0.0        0        0         1
3        2.0        0        0         1
6        2.0        0        0         0
23       2.0        0        0         1
27       2.0        0        0         0

[5 rows x 28 columns]

In [72]:
# Add a new column 'FamilySize' as the sum of 'sibsp' (siblings/spouses) and 'Parch' (parents/children)
titanic_df['FamilySize'] = titanic_df['sibsp'] + titanic_df['Parch']

# Display the first few rows to verify the new column
print(titanic_df[['Passengerid', 'sibsp', 'Parch', 'FamilySize']].head())

   Passengerid  sibsp  Parch  FamilySize
0            1      1      0           1
1            2      1      0           1
2            3      0      0           0
3            4      1      0           1
4            5      0      0           0

## Pandas I

Home exercises for Netflix:

1. Is there any missing rating?
2. How many films in 2021 correspond to your country?
3. What's the number of movies in 2020 with full information?
4. Give me the year with more titles,
5. and what has been the average in terms of releases from 2010. 

And for Titanic:

1. Calculate Gender-Based Survival Percentage

2. Calculate Survival Percentage Grouped by Gender and Class

In [ ]:
#1
import pandas as pd

# Load the Netflix dataset if not already loaded
netflix_data = pd.read_csv('session_6/netflix_titles.csv')

# Check if there are any missing values in the 'rating' column for the Netflix dataset
missing_rating_count = netflix_data['rating'].isnull().sum()

# Display the result
print("Missing values in 'rating' column:", missing_rating_count)

Missing values in 'rating' column: 4

In [ ]:
#2
# Filter for films released in 2021 from a specific country
country = 'Your Country'  # Replace 'Your Country' with the actual country name
films_2021 = netflix_data[(netflix_data['release_year'] == 2021) & 
                          (netflix_data['country'] == country) & 
                          (netflix_data['type'] == 'Movie')]

# Count the number of films
films_2021_count = films_2021.shape[0]

# Display the result
print(f"Number of films from {country} in 2021:", films_2021_count)

Number of films from Your Country in 2021: 0

In [78]:
#3
# Filter for movies released in 2020
movies_2020 = netflix_data[(netflix_data['release_year'] == 2020) & (netflix_data['type'] == 'Movie')]

# Further filter for rows without any missing values
movies_2020_full_info = movies_2020.dropna()

# Count the number of movies with full information
movies_2020_full_info_count = movies_2020_full_info.shape[0]

# Display the result
print("Number of movies in 2020 with full information:", movies_2020_full_info_count)

Number of movies in 2020 with full information: 409

In [79]:
#4
# Find the year with the most titles
year_with_most_titles = netflix_data['release_year'].value_counts().idxmax()
most_titles_count = netflix_data['release_year'].value_counts().max()

# Display the result
print(f"The year with the most titles is {year_with_most_titles}, with {most_titles_count} titles.")

The year with the most titles is 2018, with 1147 titles.

In [80]:
#5
# Filter for titles released from 2010 onwards
titles_from_2010 = netflix_data[netflix_data['release_year'] >= 2010]

# Calculate the average number of releases per year from 2010
average_releases_from_2010 = titles_from_2010['release_year'].value_counts().mean()

# Display the result
print("Average number of releases per year from 2010:", average_releases_from_2010)

Average number of releases per year from 2010: 622.6666666666666

In [81]:
#1. Calculate Gender-Based Survival Percentage
# Calculate survival percentage by gender
gender_survival_percentage = titanic_df.groupby('Sex')['2urvived'].mean() * 100

# Display the result
print("Gender-based survival percentage:\n", gender_survival_percentage)

Gender-based survival percentage:
 Sex
0    12.930012
1    50.000000
Name: 2urvived, dtype: float64

In [82]:
#2. Calculate Survival Percentage Grouped by Gender and Class
# Calculate survival percentage grouped by gender and class
gender_class_survival_percentage = titanic_df.groupby(['Sex', 'Pclass'])['2urvived'].mean() * 100

# Display the result
print("Survival percentage grouped by gender and class:\n", gender_class_survival_percentage)

Survival percentage grouped by gender and class:
 Sex  Pclass
0    1         25.139665
     2          9.941520
     3          9.533469
1    1         63.194444
     2         66.037736
     3         33.333333
Name: 2urvived, dtype: float64